bench/docker.fileio.txt
root@94386069595a:/# sysbench --threads=2 fileio --file-test-mode=rndrw run
sysbench 1.0.11 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 2
Initializing random number generator from current time


Extra file open flags: 0
128 files, 16MiB each
2GiB total file size
Block size 16KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Periodic FSYNC enabled, calling fsync() each 100 requests.
Calling fsync() at the end of test, Enabled.
Using synchronous I/O mode
Doing random r/w test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      41.95
    writes/s:                     27.96
    fsyncs/s:                     80.40

Throughput:
    read, MiB/s:                  0.66
    written, MiB/s:               0.44

General statistics:
    total time:                          10.0109s
    total number of events:              1505

Latency (ms):
         min:                                  0.01
         avg:                                 13.29
         max:                                518.78
         95th percentile:                     29.19
         sum:                              20007.11

Threads fairness:
    events (avg/stddev):           752.5000/26.50
    execution time (avg/stddev):   10.0036/0.00