bench/vm.fileio.txt
sysbench 1.0.14 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 2
Initializing random number generator from current time


Extra file open flags: (none)
128 files, 16MiB each
2GiB total file size
Block size 16KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Periodic FSYNC enabled, calling fsync() each 100 requests.
Calling fsync() at the end of test, Enabled.
Using synchronous I/O mode
Doing random r/w test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      47.93
    writes/s:                     31.95
    fsyncs/s:                     90.16

Throughput:
    read, MiB/s:                  0.75
    written, MiB/s:               0.50

General statistics:
    total time:                          10.0135s
    total number of events:              1703

Latency (ms):
         min:                                    0.00
         avg:                                   11.75
         max:                                  502.35
         95th percentile:                       23.95
         sum:                                20012.41

Threads fairness:
    events (avg/stddev):           851.5000/46.50
    execution time (avg/stddev):   10.0062/0.00